app/controllers/users_controller.rb

  def create
    # parse phone number and save it in the correct format
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "phone", "updated_at", "verified") VALUES (?, ?, ?, ?, ?, ?)