app/controllers/verifications_controller.rb

  def create

    @message = Message.create(:body=>params["Body"].downcase, :image=>params["MediaUrl"])

    # @message.body = params["Body"].downcase
    @phone = params["Phone"]

    # Instantiate a Twilio client
    @client = Twilio::REST::Client.new(TWILIO_CONFIG['sid'], TWILIO_CONFIG['token'])

    # New user verification
    if @user && @user.verified==nil
      @phone = @user.phone
      if @message.body == "yes"
        @user.update_attribute(:verified, true)
---
INSERT INTO "messages" ("body", "created_at", "from", "image", "item_requested", "upc", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "verified" = 't', "updated_at" = '2014-08-17 01:00:34.151486' WHERE "users"."id" = 36


          item_info = JSON.parse(res.body)["result"]
          if item_info
             @item = Item.create(item_info)
---
INSERT INTO "items" ("ProductHasImage", "ProductHasNutritionFacts", "brand", "catID", "category", "container", "created_at", "description", "image", "imagethumb", "ingredients", "manufacturer", "size", "units", "upc", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)


              @item.image = result["imageURL"]
              @item.imagethumb = result["imageThumbURL"]
              @item.save
---
UPDATE "items" SET "image" = 'https://s3.amazonaws.com/simpleupc-images/g1/full/4e0f6da0a2dc8a0e.jpg', "imagethumb" = 'https://s3.amazonaws.com/simpleupc-images/g1/thumb/4e0f6da0a2dc8a0e.jpg', "updated_at" = '2014-08-17 01:38:58.760777' WHERE "items"."id" = 32